package functions;

/**
 * Интерфейс для функций одной переменной
 */
public interface Function {

    /**
     * Возвращает значение левой границы области определения функции
     * @return левая граница области определения
     */
    double getLeftDomainBorder();

    /**
     * Возвращает значение правой границы области определения функции
     * @return правая граница области определения
     */
    double getRightDomainBorder();

    /**
     * Возвращает значение функции в заданной точке
     * @param x точка, в которой вычисляется значение функции
     * @return значение функции в точке x
     */
    double getFunctionValue(double x);
}
